Repository: 84000/data-translation-memory
Catalog: toh503_84000-the-detailed-account-of-the-previous-aspirations-of-the-seven-thus-gone-ones.tmx
Source language: bo
Languages: en

source: །དེ་ནས་ལྷའི་བུ་དེ་དག་དང་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་ངོ་མཚར་དུ་གྱུར་ནས། ལེགས་སོ་ཞེས་བྱ་བ་གསོལ་ཏེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ལ། ལེགས་སོ་ལེགས་སོ་ཞེས་གསོལ་ནས་འཁོར་དེ་ཐམས་ཅད་ཀྱིས་རང་རང་གི་དགེ་བའི་རྩ་བའི་བསོད་ནམས་ལས་ངེས་པར་བྱུང་བའི་མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། སྤུད་པ་དང་། རྒྱན་རྣམས་དང་། ལྷའི་རོལ་མོའི་སྒྲ་རྣམས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་མངོན་པར་མཆོད་དེ།
en: All the gods and the entire assembly were amazed and applauded the blessed Thus-Gone Śākyamuni saying, “Very good, very good!” The entire assembly made offerings directly to the thus-gone ones with flowers, incense, perfumes, garlands, ointments, ornaments, jewelry, and divine music that arose due to the merit of their own roots of virtue.

source: ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ཚིག་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: They circumambulated them three times and all the beings there proclaimed an aspiration saying, “Amazing!

source: །ཀྱེ་མ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཡུལ་དང་། སྔོན་གྱི་སྨོན་ལམ་གྱི་ཁྱད་པར་དང་ཐབས་ལ་མཁས་པ་ནི་ངོ་མཚར་དུ་བགྱི་བ་ལགས་ཏེ།
en: The buddha realm of the blessed buddhas, the unique aspirations they made previously, and their skillful means can perform miracles!

source: སེམས་ཅན་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཡུལ་གྱི་ཏིང་ངེ་འཛིན་འདི་ལྟ་བུ་ཐོབ་པར་གྱུར་ཅིག །ཅེས་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱིས་སྨོན་ལམ་དེ་སྐད་བཏབ་བོ།
en: May all beings attain this buddha realm absorption!”

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་སྟན་ལས་ལངས་ཏེ། ཐལ་མོ་སྦྱར་ནས་དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་ལན་བདུན་བསྐོར་བ་བྱས་ཏེ།
en: Then Mañjuśrīkumārabhūta rose from his seat, placed his palms together, and circumambulated those thus-gone ones seven times.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: He then said to the thus-gone ones, “Amazing!

source: །ཀྱེ་མ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་བྱིན་གྱིས་བརླབས་དང་། ཐབས་ལ་མཁས་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་མཛད་པ་ནི་བསམ་གྱིས་མི་ཁྱབ་བོ། །ཡང་བཅོམ་ལྡན་འདས་ཇི་ལྟར་སླད་མིའི་ཚེ། སླད་མའི་དུས་ན་སེམས་ཅན་བསོད་ནམས་ཆུང་བ་བྲོ་ནད་སྣ་ཚོགས་ཀྱིས་ལུས་ཡོངས་སུ་གཟིར་བ། གནོད་སེམས་སུ་གྱུར་པ། གཟའ་དང་། རྒྱུ་སྐར་གྱི་གནོད་པ་བྱུང་བ།
en: The blessing of the thus-gone ones’ absorption, their skillful means, and their ripening of beings is inconceivable!

source: འཆི་བ་དང་། དགྲ་དང་། དགོན་པས་གནོད་པར་གྱུར་པ་ཐམས་ཅད་འཇིགས་པ་ཐམས་ཅད་ལས་བསྐྱབ་པ་དང་། མགོན་བགྱི་བ་དང་། སེམས་ཅན་དེ་དག་གིས་བཅངས་སམ། བཀླགས་སམ། ཡི་གེར་འདྲིའམ། ཡི་གེར་འདྲིར་སྩོལ་ཏམ། འདོན་ན་དེ་བཞིན་གཤེགས་པས་དགོངས་པ་དང་། དེ་བཞིན་གཤེགས་པ་མཐོང་བ་དང་། བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་དང་། ལོག་པར་ལྟུང་བར་མི་མཆི་བ་དང་། དུས་མ་ལགས་པར་འགུམ་པར་མི་འགྱུར་བར་དེ་བཞིན་གཤེགས་པའི་སྔོན་གྱི་སྨོན་ལམ་གྱིས་བྱིན་གྱིས་བརླབས་པའི་གཟུངས་ཀྱི་ཚིག་དེ་ལྟ་བུ་བཤད་དུ་གསོལ།
en: Blessed ones, please pronounce a dhāraṇī verse that has been blessed by the thus-gone ones’ previous aspirations so that, in the future, beings with little merit will be protected and given a refuge from all manner of perilous situations—such as having a body that is tormented by various illnesses, being threatened by beings with ill intentions, planetary influences, and lunar asterisms, or by death, enemies, and the wilderness—and so that when they hold, read, copy, commission a copy, or recite it, the thus-gone ones will turn their attention toward them, they will see the thus-gone ones, and all their wishes will be fulfilled.”

source: དེ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ། ལེགས་སོ་ཞེས་བྱ་བ་གནང་སྟེ།
en: The blessed buddhas said to Mañjuśrīkumārabhūta, “Very good, very good.

source: འཇམ་དཔལ་ལེགས་སོ་ལེགས་སོ།
en: Mañjuśrī, very good!

source: །འཇམ་དཔལ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དང་སྙིང་རྗེ་བའི་ཕྱིར། ཁྱོད་ཀྱི་སྤོབས་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱིས་བརླབས་ཀྱིས་སྐྱེས་སོ།
en: Mañjuśrī, your eloquent request, which you have made out of compassion and for the benefit of all beings, has come about through the blessing of the thus-gone ones.

source: །ཡང་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་བཤད་དོ།
en: Listen well and pay attention, and we will explain.

source: །འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་གྱི་སྟོབས་བསྐྱེད་པའི་བཻ་ཌཱུརྱའི་འོད་ཅེས་བྱ་བའི་གཟུངས་ཡོད་དེ།
en: Mañjuśrī, there is a dhāraṇī called blue beryl radiance that produces the thus-gone ones’ power of absorption.

source: རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་སེམས་ཅན་ཐམས་ཅད་སྙིང་རྗེ་བའི་སེམས་ཀྱིས་གཟུངས་དེ་བཟུང་ངམ། བཀླགས་སམ། མཆོད་ན་བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར།
en: When a son or daughter of good family with a compassionate attitude toward all beings holds this dhāraṇī, reads it, or makes offerings to it, all their wishes will be fulfilled.

source: དེ་བཞིན་གཤེགས་པས་དགོངས་ཤིང་དེ་བཞིན་གཤེགས་པ་མཐོང་བར་འགྱུར། ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་དག་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སྐྱེ་བར་འགྱུར་རོ།
en: The thus-gone ones will turn their attention toward them, they will see the thus-gone ones, and they will be born in buddhafields where all their karmic obscurations have been purified away.”

source: །འཇམ་དཔལ་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་གྱི་སྟོབས་བསྐྱེད་པ་བཻ་ཌཱུརྱའི་འོད་ཅེས་བགྱི་བའི་གཟུངས་དེ་གང་ལགས།
en: Mañjuśrī asked, “Blessed Ones, what is the dhāraṇī called blue beryl radiance that produces the thus-gone ones’ power of absorption

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་དེ་དག་གིས་གསུང་དབྱངས་གཅིག་གིས་གཟུངས་ཀྱི་ཚིག་འདི་དག་བཀའ་སྩལ་ཏོ། །ཏདྱ་ཐཱ། གྷུ་མེ་གྷུ་མེ། ཨི་མི། ནི་མི་ཧི། མ་ཏི་མ་ཏི། སཔྟ་ཏ་ཐཱ་ག་ཏ་ས་མཱ་དྷྱ་དྷི་ཥྛི་ཏེ། ཨ་ཏི་མ་ཏེ། པཱ་ལེ། པཱ་པྃ་ཤོ་དྷ་ནི། སརྦ་པཱ་པྃ་ནཱ་ཤ་ཡ། མ་མ་བུདྷེ། བུདྡྷོཏྟ་མེ། ཨུ་མེ། ཀུ་མེ། བུདྡྷ་ཀྵེ་ཏྲ་པ་རི་ཤོ་དྷ་ནི། དྷ་མེ། ནི་དྷ་མེ། མེ་རུ་མེ་རུ། མེ་རུ་ཤི་ཁ་རེ། སརྦ་ཨ་ཀཱ་ལ་མྲྀ་ཏྱུ་ནི་བཱ་ར་ཎི། བུདྡྷེ་སུ་བུདྡྷེ་བུདྡྷཱ་དྷིཥྛཱི་ན། རཀྵ་ནྟུ་མེ། སརྦ་དེ་བཱ།
en: Then the thus-gone ones proclaimed the following dhāraṇī verse with a single melodious voice:

source: ས་མེ་ཨ་ས་མེ་ས་མ་ནྭཱ་ཧ་རནྟུ་མེ། སརྦ་བུདྡྷ། བོ་དྷི་ས་ཏྭཱ་ནཱཾ། ཤ་མེ་ཤ་མེ། པྲ་ཤ་མནྟུ་མེ་སརྦ་ཨི་ཏྱུ་པ་དྲ་བ་བྱཱ་དྷ་ཡཿ།
en: “tadyathā ghume ghume imi nimihi matimati saptatathāgatasamādhyadhiṣṭhite atimate pāle pāpaṃ śodhani sarvapāpaṃ nāśaya mama budhe buddhottame ume kume buddhakṣetrapariśodhani dhame nidhame meru meru meruśikhare sarvākālamṛtyunivāraṇī buddhe subuddhe buddhādhiṣṭhāna rakṣantu me sarvadevā same asame samanvāharantu me sarvabuddhabodhisattvānām śame śame praśamantu me sarva ityupadravavyādhayaḥ pūraṇi pūraṇi pāraya me sarvāśāya vaiḍūryapratibhāse sarvapāpaṃ kṣayaṃ kari svāhā.”

source: པཱུ་ར་ཎི་པཱུ་ར་ཎི། པཱུ་ར་ཡ་མེ། སརྦ་ཨཱ་ཤཱ་ཡ་བཻ་ཌཱུརྱ་པྲ་ཏི་བྷཱ་སེ་སརྦ་པཱ་པཾ་ཀྵ་ཡཾ་ཀ་རི་སྭཱ་ཧཱ། གཟུངས་འདི་བཀའ་སྩལ་པའི་ཚེ་སྣང་བ་ཆེན་པོ་བྱུང་སྟེ། ས་ཆེན་པོ་གཡོས་ནས་རྫུ་འཕྲུལ་རྣམ་པར་འཕྲུལ་པ་དག་སྣང་ངོ་།
en: When they spoke this dhāraṇī there was a great light, the entire earth trembled, and miraculous signs appeared.

source: །འཁོར་ཇི་ལྟར་ལྷགས་པ་དེས་ཀྱང་ལྷའི་སྤོས་དང་། བདུག་པ་རྣམས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་མཆོད་ནས། ལེགས་སོ་ཞེས་བྱ་བ་གསོལ་ཏེ། ལན་བདུན་བསྐོར་བ་བྱས་སོ།
en: All the beings who were assembled there made offerings of divine perfumes and incense to the thus-gone ones, spoke the words “Very good, very good!” and circumambulated them seven times.

source: །དེ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག །གཟུངས་འདི་འཆང་ངམ། ཀློག་གམ། མཆོད་དམ།
en: Then the blessed buddhas said, “Any son or daughters of good family who holds this dhāraṇī, recites it, or makes offerings to it, should purify themselves.

source: གཙང་མར་བྱས་ཏེ། ཕྱོགས་གཙང་མར་འཕགས་པའི་ཡན་ལག་བརྒྱད་དང་ལྡན་པར་བྱས་ལ། སེམས་ཅན་ཐམས་ཅད་ལ་མཆོག་ཏུ་སྙིང་རྗེ་བས།
en: Then, in a clean area, they should adopt the noble eightfold precepts and arouse supreme compassion toward all beings.

source: དེས་དེ་བཞིན་གཤེགས་པ་བདུན་པོ་དེ་དག་གི་སྐུ་གཟུགས་བྱས་ལ། དེ་བཞིན་གཤེགས་པ་འདི་དག་ལ་མེ་ཏོག་དང་། བདུག་པ་དང་། མར་མེ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། རོལ་མོའི་སྒྲ་དང་། རྒྱལ་མཚན་དང་། བ་དན་རྣམས་ཀྱིས་མཆོད་པ་བྱེད་ཅིང་། ཉི་མ་བདུན་དུ་འཕགས་པའི་ཡན་ལག་བརྒྱད་ལ་གནས་ཏེ།
en: They should then make statues of the seven thus-gone ones and make offerings to the thus-gone ones with flowers, incense, oil lamps, perfumes, garlands, music, banners, and flags, and maintain the noble eightfold precepts for seven days.

source: གཟུངས་ཀྱི་ཚིག་འདི་དག་ལན་སྟོང་རྩ་བརྒྱད་དུ་བཏོན་ན། དེ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དགོངས་པར་འགྱུར། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་སེམས་པར་འགྱུར། རྡོ་རྗེ་འཛིན་ཐམས་ཅད་ཀྱང་ཡང་དག་པར་བསྲུང་བར་འགྱུར།
en: “If they then recite these dhāraṇī verses one thousand eight times, the thus-gone ones will direct their attention toward them, the bodhisattvas will think of them, and the vajra bearers will protect them.

source: ལྷ་ཐམས་ཅད་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་ཐམས་ཅད་དང་། རྒྱལ་པོ་བཞི་པོ་དག་གིས་ཀྱང་ཡོངས་སུ་བསྐྱང་བར་འགྱུར།
en: All the gods, Śakra, and all of the brahmā gods, and the Four Great Kings will protect them.

source: མཚམས་མེད་པ་ལྔ་ལ་སོགས་པ་ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་བྱང་བར་འགྱུར།
en: All their karmic obscurations, even down to the five inexpiable acts, will be purified.

source: ནད་ཐམས་ཅད་ཀྱིས་མི་བཏབ་པར་འགྱུར། རིང་དུ་འཚོ་བར་འགྱུར། དུས་མ་ཡིན་པར་འཆི་བའི་འཇིགས་པ་ཐམས་ཅད་ལས་ཡོངས་སུ་ཐར་བར་འགྱུར།
en: They will not contract any illnesses, they will have long lives, and they will be free from all fears of dying an untimely death.

source: འཆི་བ་དང་། དགྲ་དང་། དགོན་པའི་གནོད་པ་དང་། འཐབ་པ་དང་། རྩོད་པ་དང་། འགྱེད་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་འགྱུར།
en: Threats related to death, enemies, and the wilderness, along with all conflicts, arguments, and disputes, will be pacified.

source: དགྲ་ཐམས་ཅད་ཀྱི་དབང་དུ་མི་འགྲོ་བར་འགྱུར། ཅི་བསམས་པའི་བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: They will not come under their enemies’ control, and their every wish will be fulfilled.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལག་ན་རྡོ་རྗེ་དང་། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞི་དག་གིས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སྔོན་གྱི་སྨོན་ལམ་གྱི་ཁྱད་པར་རྒྱས་པ་ཡང་ཐོས།
en: Then the bodhisattva Vajrapāṇi, the lord of the gods, Śakra, and the Four Great Kings bowed to the Blessed One with their hands together and said, “Blessed One, we have heard the detailed account of these thus-gone ones’ previous aspirations.

source: བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱང་མངོན་དུ་མཐོང་སྟེ་མཆོད་པ་བགྱིས་སོ།
en: Blessed One, we have actually seen these thus-gone ones and made offerings to them.

source: །ཡང་བཅོམ་ལྡན་འདས་ས་ཕྱོགས་གང་ན་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་མཚན་དང་། གཟུངས་ཀྱི་ཚིག་འདི་དག་སྤྱོད་པ་དེར། བདག་ཅག་གཡོག་དང་བཅས་ཏེ་མཆི་བར་བགྱིའོ།
en: Blessed One, we and our attendants will go wherever the names of these thus-gone ones and these dhāraṇī verses are practiced.

source: །རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ཞིག་འཆང་བ་དང་། ཀློག་པ་དང་། མཆོད་པར་བགྱིད་པ་དང་། ཡི་གེར་འདྲི་བ་དང་། ཡི་གེར་འདྲིར་སྩོལ་བ་དེར་བདག་ཅག་མཐུན་པར་ལྷན་ཅིག་ཏུ་མཆིས་ཏེ། རིགས་ཀྱི་བུའམ།
en: When any son or daughter of good family holds them, recites them, makes offerings to them, writes them down, and commissions them to be written down, we will be there with them.

source: རིགས་ཀྱི་བུ་མོའམ། རྒྱལ་པོ་འམ། རྒྱལ་པོའི་བློན་པོ་མདོ་སྡེའི་དབང་པོ་འཛིན་པ་དང་། འདྲི་བ་དེ་ལ་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་བསྲུང་བར་བགྱིའོ། །གྲོང་དང་། གྲོང་ཁྱེར་དང་། ཕྱོགས་ཀྱང་ཡོངས་སུ་བསྐྱང་བར་བགྱིའོ། །འཆི་བ་དང་། དགྲ་དང་། དགོན་པའི་གནོད་པ་དང་། ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བགྱིའོ།
en: The blessing of these thus-gone ones will protect any son or daughter of good family and any king or minister who upholds the power of this discourse and writes it down. We will protect their villages, towns, and regions, and we will pacify all manner of threats related to death, enemies, and the wilderness, and all manner of illnesses.

source: །བདག་ཅག་ནི་དེ་བཞིན་གཤེགས་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པ་དང་། བྱས་པ་གཟོ་བ་ལགས་ཏེ། དུས་མ་ལགས་པར་འགུམ་པ་ཐམས་ཅད་བཟློག་པར་བགྱིའོ།
en: Out of our gratitude and love for the thus-gone ones and all beings, we will prevent all manner of untimely death.

source: །འཐབ་པ་དང་། འཐབ་མོ་དང་། རྩོད་པ་དང་། འགྱེད་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བགྱིའོ། །ཇི་ལྟར་བསམས་པ་དང་། སེམས་དང་ཡིད་བདེ་བ་དང་། ལོངས་སྤྱོད་དང་། དབང་ཕྱུག་དང་། ནོར་དང་། འབྲུ་རྣམས་འཕེལ་བར་བགྱིའོ།
en: We will pacify all manner of quarrels, arguments, and disputes, and increase beings’ happiness, wealth, power, riches, and harvests.

source: །དུས་ཐམས་ཅད་དུ་བསྲུང་བར་བགྱིའོ།
en: We will always protect them.

source: །བཅོམ་ལྡན་འདས་བདག་ཅག་གི་རང་གི་བྲོ་བོར་བ་དང་། དམ་བཅས་པ་འདི་དག་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེས་རྗེས་སུ་དྲན་པར་བགྱིའོ། །ཏདྱ་ཐཱ། ཨ་གྷུ། མ་གྷུ།
en: Blessed One, a son or daughter of good family should remember that these are our oaths and vows.

source: ཏ་ར་གྷུ། མ་མ་གྷུ། གྷུ་རེ།
en: “tadyathā aghu maghu taraghu mamaghu ghure hā hū he mra mra mra mra dzu dzuri dzuri svāhā.

source: ཧཱ་ཧཱུ་ཧེ། མྲ་མྲ་མྲ་མྲ། ཛུ་ཛུ་རི། ཛུ་རི་སྭཱ་ཧཱ། གང་ལ་ལ་ཞིག་དེ་བཞིན་གཤེགས་པའི་མཚན་རྣམས་དང་། གཟུངས་ཀྱི་ཚིག་འདི་དག་འཆང་བ་དང་། ཀློག་པ་དང་། ཡི་གེར་འདྲི་བ་དང་། ཡི་གེར་འདྲིར་སྩོལ་བ་དང་། རབ་ཏུ་གུས་པར་མཆོད་པ་བགྱིད་པ་དེ་ནི་ངན་སོང་གསུམ་དུ་མི་མཆི་བར་རིག་པར་བགྱི་སྟེ།
en: “You should know that anyone who wears the names of the thus-gone ones and this dhāraṇī verse, reads them, writes them down, commissions them to be written down, and makes offerings to them with devotion will never go to the three lower realms.

source: དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་སླར་མི་ལྡོག་པར་འགྱུར།
en: They will never regress on the path to unsurpassed and perfect awakening.

source: ཇི་ལྟར་འཚལ་བའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཏུ་སྐྱེ་བར་འགྱུར། དེ་བཞིན་གཤེགས་པ་རྣམས་མཐོང་བར་འགྱུར། ཚེ་རབས་དྲན་པར་འགྱུར།
en: They will be reborn in whatever buddhafields they wish, see the thus-gone ones, and remember their past lives.

source: ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱང་ཐོབ་པར་འགྱུར་རོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལག་ན་རྡོ་རྗེས།
en: They will attain the absorptions and dhāraṇīs.”

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་མདོ་སྡེའི་དབང་པོ་འཛིན་པ་དེ་དག་གི་དོན་དུ། བདག་གིས་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་རྣམས་རབ་ཏུ་སྩལ་བར་བགྱི་ཡིས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་བདག་ལ་དགོངས་སུ་གསོལ།
en: At that point the bodhisattva Vajrapāṇi asked the thus-gone ones, “Blessed Buddhas, please grant me your permission and I shall pronounce secret dhāraṇī verses for the benefit of those sons and daughters of good family who uphold the power of this discourse.”

source: དེ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་གསུང་གཅིག་གིས། བྱང་ཆུབ་སེམས་དཔའ་ལག་ན་རྡོ་རྗེ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་གནང་སྟེ། ལག་ན་རྡོ་རྗེ་ལེགས་སོ་ལེགས་སོ།
en: The blessed buddhas replied in a single voice, “Bodhisattva Vajrapāṇi, very well, very well.

source: །ལག་ན་རྡོ་རྗེ་ཁྱོད་ལ་དགོངས་ཟིན་གྱིས།
en: Vajrapāṇi, you have our permission.

source: མདོ་སྡེའི་དབང་པོ་འཛིན་པ་དེ་དག་ལ་ཕན་པར་འདོད་པ་དང་། རེ་བ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་དེ་དག་སྨྲོས་ཤིག །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལག་ན་རྡོ་རྗེས་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་སྨྲས་སོ།
en: Please pronounce the secret dhāraṇī verses so that you may fulfill all your wishes and hopes to benefit those who uphold the power of this discourse.” The bodhisattva great being Vajrapāṇi then pronounced the following secret dhāraṇī verses:

source: །ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བདུན་པོ་དེ་དག་ལ་ཕྱག་འཚལ་ལོ།
en: “Homage to the seven perfect buddhas.

source: །རྡོ་རྗེ་འཛིན་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །ཏདྱ་ཐཱ། ཨོཾ་བཛྲེ་བཛྲེ། མ་ཧཱ་བཛྲེ།
en: Homage to all vajra bearers.

source: བཛྲ་པཱ་ཤ་དྷཱ་ར་ཎཱི། ས་མ་ས་མ། ས་མནྟ། ཨ་པྲ་ཏི་ཧ་ཏ་བཛྲེ། ཤ་མ་ཤ་མ། པྲ་ཤ་མནྟུ། སརྦ་བྱཱ་དྷ་ཡཿ།
en: tadyathā oṃ vajre vajre mahāvajre vajrapāśadhāraṇi sama sama samanta apratihatavajre śama śama praśamantu sarvavyādhayaḥ kuru kuru sarvakarmāṇi samayam anusmara bhagavān vajrapāṇi sarvāśām me paripūraya svāhā

source: ཀུ་རུ་ཀུ་རུ་སརྦ་ཀརྨཱ་ཎི། ས་མ་ཡ་མ་ནུ་སྨ་ར། བྷ་ག་བཱ་ན་བཛྲ་པཱ་ཎི། སརྦ་ཨཱ་ཤཱ་མ་མེ་པ་རི་པཱུ་ར་ཡ་སྭཱ་ཧཱ། བཅོམ་ལྡན་འདས་གང་ལ་ལ་ཞིག་དེ་བཞིན་གཤེགས་པ་འདི་དག་གི་མཚན་དང་། སྔོན་གྱི་སྨོན་ལམ་གྱི་ཁྱད་པར་རྒྱས་པ་དང་། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཆང་བ་དང་། ཀློག་པ་དེའི་རེ་བ་ཐམས་ཅད་བདག་གིས་ཡོངས་སུ་བསྐང་བར་བགྱི།
en: “Blessed Ones, I shall fulfill every wish for anyone who bears and recites these names of the thus-gone ones, the detailed account of their previous aspirations, and this Dharma discourse.

source: དོན་ཐམས་ཅད་ཀྱང་བསྒྲུབ་པར་བགྱིའོ། །གལ་ཏེ་དེས་བདག་མཐོང་བར་འཚལ་ན།
en: I will accomplish all their aims.

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡི་གེར་འདྲིར་སྩལ་བར་བགྱི། དེ་བཞིན་གཤེགས་པ་འདི་དག་གི་སྐུ་གཟུགས་བདུན་ཀྱང་བགྱི། རྡོ་རྗེ་འཛིན་ཀྱང་སྐུ་གདུང་དང་བཅས་པར་བགྱི། དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་ཡང་ཇི་སྐད་གོང་དུ་སྨོས་པ་བཞིན་དུ། སྤོས་དང་། བདུག་པ་དང་། མར་མེ་དང་། ཕྲེང་བ་དང་། རྒྱན་དང་། རོལ་མོའི་སྒྲ་དང་། སིལ་སྙན་དང་། ཕེག་རྡོབ་པ་རྣམས་ཀྱིས་མཆོད་དེ་བསྐོར་བར་བགྱི།
en: If they wish to see me, they should commission this Dharma discourse to be written down, make seven statues of these thus-gone ones, and create a bodily representation of the Vajra Bearer. As they pronounce the above dhāraṇī to those thus-gone ones, they should offer perfumes, incense, oil lamps, garlands, ornaments, songs, instruments, and drums as they circumambulate them and chant these secret dhāraṇī root verses.

source: གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་ཀྱང་གདོན་པར་བགྱི། སེམས་ཅན་ཐམས་ཅད་ལ་ཡང་ཕན་པའི་སེམས་དང་། བྱམས་པའི་སེམས་སུ་བགྱི།
en: They should arouse a loving attitude and the intention to benefit all beings.

source: འཕགས་པའི་ཡན་ལག་བརྒྱད་པའི་བསྙེན་གནས་ལ་གནས་ཏེ།
en: They should maintain the noble eightfold precepts.

source: ལན་གསུམ་ཁྲུས་བགྱི་ཞིང་། གོས་ལན་གསུམ་བརྗེ་བར་བགྱི། ཚེས་བརྒྱད་ནས་བརྩམས་ཏེ།
en: They should wash themselves three times and change clothes three times.

source: ཟླ་བ་ཕྱི་མ་བཅྭ་ལྔ་ཉའི་བར་དུ་ཉིན་གཅིག་བཞིན་རིག་སྔགས་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་ན། དེ་དག་ལ་བདག་གིས་རྨི་ལམ་དུ་མཐོང་བ་སྩལ་བར་བགྱི། འབེལ་བའི་བཀའ་མཆིད་ཀྱང་བགྱི། རེ་བ་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་བསྐང་བར་བགྱིའོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་དེ་དག་ཐམས་ཅད་ཀྱིས།
en: Then, if they recite the vidyāmantra one hundred and eight times each day from the eighth until the full moon on the fifteenth day of the next month, I will grant them a vision in their dreams, instruct them at length, and fulfill all their hopes.”

source: བྱང་ཆུབ་སེམས་དཔའ་ལག་ན་རྡོ་རྗེ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ། ལག་ན་རྡོ་རྗེ་ཁྱོད་ཀྱིས་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་ལེགས་པར་སྨྲས་པ།
en: The entire retinue of bodhisattvas expressed their approval to the bodhisattva Vajrapāṇi, saying, “Vajrapāṇi, you have taught these secret dhāraṇī root verses well.

source: ལེགས་སོ་ལེགས་སོ།
en: Excellent!”

source: །དེ་བཞིན་གཤེགས་པ་དེ་དག་གིས་ཀྱང་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ལག་ན་རྡོ་རྗེ་ངེད་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དང་། ཕན་པ་དང་། རེ་བ་ཐམས་ཅད་ཡོངས་སུ་བསྐང་བའི་ཕྱིར། གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་བྱིན་གྱིས་བརླབས་སོ། །དེ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་རྣམས་ལ་བོས་ཏེ་བཀའ་སྩལ་པ། གྲོགས་པོ་དག་ཁྱེད་ལ་ཆོས་ཀྱི་རྣམ་གྲངས་ཆེན་པོ་འདི་རྗེས་སུ་གཏད་ཀྱིས། ཁྱེད་ཀྱིས་ཅི་ནས་ཀྱང་ཆོས་ཀྱི་རྣམ་གྲངས་ཆེན་པོ་དེ་བཞིན་གཤེགས་པ་དང་མཚུངས་པ། སྡིག་པ་ཐམས་ཅད་བྱང་བར་བྱེད་པ། རེ་བ་ཐམས་ཅད་ཡོངས་སུ་སྐོང་བ་འདི་ཕྱི་མའི་ཚེ་ཕྱི་མའི་དུས་ལྔ་བརྒྱ་པ་ཐ་མ་ལ། སེམས་ཅན་བསོད་ནམས་ཆུང་ངུ་། དམ་པའི་ཆོས་སྤོང་བ། འཕགས་པ་ལ་སྐུར་པ་འདེབས་པ་རྣམས་ཀྱི་ལག་ཏུ་མྱུར་དུ་ནུབ་པར་མི་འགྱུར་བར་སྲུངས་ཤིག །དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་སྟན་ལས་ལངས་ཏེ།
en: The thus-gone ones said, “Vajrapāṇi, we bless these secret dhāraṇī root verses so that they may benefit all beings, help them, and fulfill all their hopes.” Then the blessed buddhas summoned Śakra, Brahmā, and the world protectors and said, “Friends, since we have entrusted this great Dharma discourse to you, you must make sure to protect this Dharma discourse—a Dharma discourse that is the same as the thus-gone ones, that purifies all misdeeds, and that fulfills all hopes—so that later, during the final five hundred years, it will not fall into the hands of beings with little merit, who forsake the holy Dharma, and who denigrate the noble ones, and thus quickly disappear.”

source: བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མིང་ཅི་ལགས།
en: “Then venerable Ānanda rose from his seat, adjusted his upper robe on one shoulder, knelt with his right knee on the ground, bowed to the Blessed One with his palms together, and asked, “Blessed One, what is the name of this Dharma discourse?

source: འདི་ཇི་ལྟར་གཟུང་བར་བགྱི།
en: How should it be remembered?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་དེའི་ཕྱིར། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བདུན་གྱི་སྔོན་གྱི་སྨོན་ལམ་གྱི་ཁྱད་པར་རྒྱས་པ་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །བྱང་ཆུབ་སེམས་དཔའ་ལག་ན་རྡོ་རྗེས་དམ་བཅས་པ་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སྦྱོང་ཞིང་།
en: The Blessed One replied, “Ānanda, this Dharma discourse should be remembered as The Detailed Account of the Previous Aspirations of the Seven Thus-Gone, Worthy, and Perfect Buddhas . It should also be remembered as The Bodhisattva Vajrapāṇi’s Vow

source: རེ་བ་ཐམས་ཅད་ཡོངས་སུ་སྐོང་བ་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་བཅུ་གཉིས་ཀྱིས་དམ་བཅས་པ་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།
en: It should also be remembered as Purifying All Karmic Obscurations and Fulfilling All Hopes . And it should also be remembered as The Vows of the Twelve Great Yakṣa Generals

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དག་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།།
en: When the Blessed One had spoken, Mañjuśrīkumārabhūta, the bodhisattvas, Lord of Secrets Vajrapāṇi, the entire retinue, and the whole world with its gods, humans, asuras, and gandharvas rejoiced and praised what the Blessed One had said.

source: །།འཕགས་པ་དེ་བཞིན་གཤེགས་པ་བདུན་གྱི་སྔོན་གྱི་སྨོན་ལམ་གྱི་ཁྱད་པར་རྒྱས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་བརྒྱད་བརྒྱ་པ་རྫོགས་སྷོ།།
en: This concludes the Great Vehicle discourse in eight hundred lines entitled The Detailed Account of the Previous Aspirations of the Seven Thus-Gone Ones.

source: །།རྒྱ་གར་གྱི་མཁན་པོ་ཛི་ན་མི་ཏྲ་དང་། དཱ་ན་ཤཱི་ལ་དང་། ཤི་ལནྡྲ་བོ་དྷི་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་བནྡེ་ཡེ་ཤེས་སྡེས་བསྒྱུར་ཅིང་ཞུས་ཏེ་སྐད་གསར་ཆད་ཀྱིས་ཀྱང་བཅོས་ནས་གཏན་ལ་ཕབ་པ།།
en: Translated, edited, and finalized according to the new language reform by the Indian preceptors Jinamitra, Dānaśīla, and Śīlendrabodhi, along with the chief editor and translator Bandé Yeshé Dé.
